<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fa4ca8fd9727ded1ea8208d0a732c2f3bdb5104a5381349b8834a0a26fa066af","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #889 at https://github.com/cal-itp/data-infra/actions/runs/18955197369","plan_out_hash":"a80ca30ddd45cad214c8cd495648320aa9d4d3d977e237ff43d3d50c64ef928e","plan_hash":"535e0b6a73f80dcf457c838c798be6b177788a46f805f63b1428ee8c26ab3461","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "JiH76w==" -> (known after apply)
!~      detect_md5hash      = "y+zH5zi1iBckCS9dcMXqwQ==" -> "different hash"
!~      generation          = 1752703531845452 -> (known after apply)
        id                  = "calitp-composer-dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"
!~      md5hash             = "y+zH5zi1iBckCS9dcMXqwQ==" -> (known after apply)
        name                = "dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "Z+nINw==" -> (known after apply)
!~      detect_md5hash      = "oztTJY65DeqKvihHgQQiAQ==" -> "different hash"
!~      generation          = 1761769654941394 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "oztTJY65DeqKvihHgQQiAQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "qfwvow==" -> (known after apply)
!~      detect_md5hash      = "1cJlOr5NQvragutOKHNfgg==" -> "different hash"
!~      generation          = 1761769656597758 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "1cJlOr5NQvragutOKHNfgg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #889](https://github.com/cal-itp/data-infra/actions/runs/18955197369)